Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: ངེས་པར་འབྱུང་བའི་ཆོས་དྲུག་སྟེ། དྲུག་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སངས་རྒྱས་རྗེས་སུ་དྲན་པ་དང་། ཆོས་རྗེས་སུ་དྲན་པ་དང་། དགེ་འདུན་རྗེས་སུ་དྲན་པ་དང་། ཚུལ་ཁྲིམས་རྗེས་སུ་དྲན་པ་དང་། གཏོང་བ་རྗེས་སུ་དྲན་པ་དང་། ལྷ་རྗེས་སུ་དྲན་པ་སྟེ། འདི་ནི་ངེས་པར་འབྱུང་ཆོས་དྲུག་གོ །
en: “There are six dharmas that are conducive to deliverance. What are they? They are recollecting the Buddha, recollecting the Dharma, recollecting the Saṅgha, recollecting morality, recollecting renunciation, and recollecting the gods. These are the six dharmas that are conducive to deliverance.

source: ངེས་པར་བའི་འབྱུང་བའི་ཆོས་བདུན་ཏེ། བདུན་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དྲན་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ཆོས་རྣམ་པར་འབྱེད་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། བརྩོན་འགྲུས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། དགའ་བ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ཤིན་ཏུ་སྦྱངས་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ཏིང་ངེ་འཛིན་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། བཏང་སྙོམས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་སྟེ། འདི་བདུན་ཡང་གོང་མ་བཞིན་ནོ། །
en: “There are seven dharmas that are conducive to deliverance. What are they? They are the factors of awakening that is mindfulness, the factors of awakening that is the examination of phenomena, the factors of awakening that is vigor, the factors of awakening that is contentment, the factors of awakening that is trust, the factors of awakening that is concentration, and the factors of awakening that is equanimity. These seven dharmas are conducive to deliverance.

source: ངེས་པར་འབྱུང་བའི་ཆོས་བརྒྱད་དེ། བརྒྱད་གང་ཞེ་ན། འདི་ལྟ་སྟེ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའོ། ། འདི་ལྟ་སྟེ། ཡང་དག་པའི་ལྟ་བ་དང་། ཡང་དག་པའི་རྟོག་པ་དང་། ཡང་དག་པའི་ངག་དང་། ཡང་དག་པའི་ལས་ཀྱི་མཐའ་དང་། ཡང་དག་པའི་འཚོ་བ་དང་། ཡང་དག་པའི་རྩོལ་བ་དང་། ཡང་དག་པའི་དྲན་པ་དང་། ཡང་དག་པའི་ཏིང་ངེ་འཛིན་ཏེ་འདི་བརྒྱད་ཀྱང་གོང་མ་བཞིན་ནོ། །
en: “There are eight dharmas that are conducive to awakening. What are they? They are the noble eightfold path: right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, and right concentration. These eight dharmas are conducive to deliverance.

source: མཆོག་ཏུ་དགེ་བའི་རྩ་བ་ལས་སྐྱེས་པའི་ཆོས་དགུ་སྟེ། དགུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། མཆོག་ཏུ་དགའ་བ་དང་དགའ་བ་དང་ཤིན་ཏུ་སྦྱངས་པ་དང་། བདེ་བ་དང་། ཏིང་ངེ་འཛིན་དང་། ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡེ་ཤེས་མཐོང་བ་དང་། མྱ་ངན་ལས་འདས་པ་དང་། འདོད་ཆགས་དང་བྲལ་བ་དང་། རྣམ་པར་གྲོལ་བ་སྟེ།
en: “There are nine dharmas that are the roots of joy. What are they? They are joy, contentment, trust, happiness, concentration, knowledge that sees things as they really are, nirvāṇa, passionlessness, and liberation. These nine dharmas are conducive to deliverance.

source: འདི་དགུ་ཡང་གོང་མ་བཞིན་ནོ། ། ངེས་པར་འབྱུང་བའི་ཆོས་བཅུ་སྟེ། བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་མོ། ། འདི་ལྟ་སྟེ། སྲོག་གཅོད་པ་སྤངས་པ་དང་། མ་བྱིན་པར་ལེན་པ་སྤངས་པ་དང་། འདོད་པ་ལ་ལོག་པར་གཡེམ་པ་སྤངས་པ་དང་། བརྫུན་དུ་སྨྲ་བ་སྤངས་པ་དང་། ཕྲ་མ་སྤངས་པ་དང་། ངག་རྩུབ་པོ་སྤངས་པ་དང་། ཚིག་ཀྱལ་པ་སྤངས་པ་དང་། བརྣབ་སེམས་མེད་པ་དང་། གནོད་སེམས་མེད་པ་དང་། ཡང་དག་པར་ལྟ་བ་སྟེ། འདི་ཡང་གོང་མ་བཞིན་ཏེ། ལམ་འདི་ནི་ངེས་པར་འབྱུང་བར་འགྱུར་བའོ། །
en: “There are ten dharmas that are conducive to awakening. What are they? They are the ten wholesome forms of conduct: abstaining from taking life, abstaining from taking what is not given, abstaining from sexual misconduct, abstaining from lying, abstaining from slander, abstaining from harsh words, not chattering inanely, not being covetous, not being malicious, and having right views. These ten dharmas are conducive to deliverance. “This is the path that is conducive to deliverance.

source: འདི་ལྟར་ཤཱ་རིའི་བུ་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཀྱི་དགེ་བ་ཇི་སྙེད་པ་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་དང་ལྡན་པའམ། ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་དང་ལྡན་པའམ། ཤེས་རབ་ཀྱི་ཕུང་པོ་དང་ལྡན་པའམ། རྣམ་པར་གྲོལ་བའི་ཕུང་པོ་དང་ལྡན་པའམ། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བའི་ཕུང་པོ་དང་ལྡན་པའམ། འཕགས་པའི་བདེན་པ་དང་ལྡན་པ་དེ་དག་ཀྱང་ངེས་པར་འབྱུང་བའི་ལམ་ཞེས་བྱའོ། །
en: Śāriputra, whatever these wholesome dharmas conducive to awakening may be—those connected to morality, those connected to concentration, those connected to knowledge, those connected to liberation, or those connected to insight into the knowledge of liberation or to the noble truths—they are said to be paths that are conducive to deliverance.

source: གཞན་ཡང་ངེས་པར་འབྱུང་བ་ཞེས་བྱ་བ་ནི་ཡང་དག་པར་སྒྲུབ་པ་གང་ཡིན་པ་སྟེ། གང་ཡང་དག་པར་སྒྲུབ་པ་དེ་ལ་ནི་ཆོས་གང་ཡང་སོགས་པའམ། འབྲི་བའམ། བླང་བའམ། དོར་བའམ། གཟུང་བའམ། སྤང་བ་མེད་དོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཡང་དག་པར་སྒྲུབ་པ་ལ་ཞུགས་པ་ནི་གཉིས་ལ་བློ་མི་འཇུག་སྟེ། ཆོས་ཐམས་ཅད་གཉིས་སུ་མེད་པར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡེ་ཤེས་མཐོང་བ་ནི་ངེས་པར་འབྱུང་བའི་ལམ་སྟེ། དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་རྣམས་ལ་ངེས་པར་འབྱུང་བའི་ལམ་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏོ། །
en: “Moreover, what is said to be a path conducive to deliverance is something that leads to genuine attainment. Avoiding accumulating any phenomenon and avoiding diminishing, striving after, relinquishing, appropriating, or abandoning any phenomenon leads to genuine attainment. Why is this? It is because genuine attainment is not possible on the basis of a dualistic intellectual approach. Possessing the knowledge that sees the actual nondual nature of all phenomena is the path that is conducive to deliverance, and the Tathāgata instructs sentient beings in this path that is conducive to deliverance.

source: དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་དེ་ཡང་འཁོར་ཐམས་ཅད་ཤེས་པར་བྱེད་པ། འཁོར་ཐམས་ཅད་མགུ་བར་བྱེད་པ། འཁོར་ཐམས་ཅད་ཀྱི་ལུས་སིམ་པར་བྱེད་པ། འཁོར་ཐམས་ཅད་ཀྱི་སེམས་ཚིམ་པ་སྐྱེད་པ། འཁོར་ཐམས་ཅད་དགའ་བ་དང་། རབ་ཏུ་དགའ་བ་དང་། དད་པ་སྐྱེད་པ། སྙིང་རྗེ་ཆེན་པོས་སྦྱོར་བ། དེ་བཞིན་ཉིད་ཀྱི་མཉམ་པ་དེ་ཁོ་ན་ཉིད། དེ་བཞིན་ཉིད་གཞན་མ་ཡིན་པ་ཉིད། མི་འགྱུར་བ་ཉིད། མི་འཁྲུགས་པ་ཉིད། འབྱུང་བ་མེད་པ་ཉིད། འཇིག་པ་མེད་པ་ཉིད། རྩོད་པ་མེད་པ་ཉིད་དེ་དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་ལ་རྩོད་པ་གང་ཡང་མེད་དོ། ། དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་ནི་རྩོད་པ་མེད་པ། འཐབ་པ་མེད་པའོ། ། དེ་བཞིན་ཉིད་དང་མཉམ་ཞིང་ཆོས་ཀྱི་དབྱིངས་ངོས་མཉམ་པ་འཇིག་རྟེན་གྱི་ཁམས་རབ་འབྱམ་མ་ལུས་པ་ཐམས་ཅད་ལ་ཐོགས་པ་མེད་པའོ། །
en: “And this confidence of the Tathāgata is known in all assemblies. It satisfies all assemblies, refreshens all assemblies, exhilarates all assemblies, and gladdens, delights, and engages all assemblies. It is the practice of great compassion, and it is the same as the nature of things, real, actual, not inaccurate, unchanging, and imperturbable. It does not appear or perish. It is indisputable, as no one can dispute the confidence of the Tathāgata. One cannot challenge the indisputable confidence of the Tathāgata. It is the same as the nature of things, the same as the face of the totality of phenomena, unobstructed in all the vast stretches of the ten directions of the world. Thus, being in possession of immeasurable, innumerable, inconceivable, unequaled, inexpressible qualities and a mind filled with great compassion, the Tathāgata expounds the path that leads to deliverance.

source: དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་ཚད་མེད། གྲངས་མེད། བསམ་གྱིས་མི་ཁྱབ། གཞལ་དུ་མེད། དཔག་ཏུ་མེད། བརྗོད་དུ་མེད་པའི་ཆོས་དང་ལྡན་ཞིང་སྙིང་རྗེ་ཆེན་པོས་ཟིན་པའི་སེམས་ཀྱིས་སེམས་ཅན་རྣམས་ལ་ངེས་པར་འབྱུང་བའི་ལམ་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏེ། དེ་སོ་སོར་རྟོགས་པས་སེམས་ཅན་དེར་འཇུག་པ་རྣམས་དེར་བྱེད་པའི་སྡུག་བསྔལ་ཡང་དག་པར་ཟད་ཅིང་ངེས་པར་འབྱུང་བར་འགྱུར་རོ། །
en: “When sentient beings understand this and engage with it, the genuine elimination of suffering follows, and this, Śāriputra, is the fourth of the tathāgata confidences. With this confidence, the Tathāgata roars a true lion’s roar in the assembly, asserts the state of the supreme bull, and turns the holy wheel that no ascetic, brahmin, god, māra, or brahmā of this world has legitimately turned.

source: ཤཱ་རིའི་བུ་འདི་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་བཞི་པ་སྟེ། མི་འཇིགས་པ་དེ་དང་ལྡན་པས་དེ་བཞིན་གཤེགས་པ་འཁོར་གྱི་ནང་དུ་སེང་གེའི་སྒྲ་ཡང་དག་པར་སྒྲོག་ཅིང་ཁྱུ་མཆོག་གི་གནས་སུ་ཞལ་གྱིས་འཆེ་སྟེ། དགེ་སྦྱོང་ངམ། བྲམ་ཟེ་འམ། ལྷ་འམ། བདུད་དམ། ཚངས་པ་འམ། སུས་ཀྱང་འཇིག་རྟེན་འདིར་ཆོས་དང་འཐུན་པར་མ་བསྐོར་བ་ཚངས་པའི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་ཏོ། ། དེ་ལྟར་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་བཞི་མཐའ་ཡས་མུ་མེད་དོ། ། འདི་ལྟ་སྟེ། དཔེར་ན་ཤཱ་རིའི་བུ་ནམ་མཁའ་མཐའ་ཡས་མུ་མེད་པ་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་བཞི་ཡང་མཐའ་ཡས་མུ་མེད་དེ། སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཟད་པར་མི་འགྱུར་རོ། ། ཤཱ་རིའི་བུ་གང་དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པའི་མཐའ་འདོད་པ་དེ་ནི་ནམ་མཁའི་མཐའ་འདོད་དོ། ། བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ཐོས་ནས། མངོན་པར་དད། ཡིད་ཆེས། རབ་ཏུ་རྟོག ། སོམ་ཉི་མེད། ཐེ་ཚོམ་མི་ཟ། རྒྱ་ཆེར་དགའ་མགུ་སྟེ་རངས་པ་རྙེད་ནས་ནམ་མཁའ་ལྟ་བུར་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར། ངོ་མཚར་དང་། རྨད་ཀྱི་བར་དུ་འདུ་ཤེས་སྐྱེད་དོ། །
en: “Thus, Śāriputra, the four types of confidence of the Tathāgata are boundless. Just as space is boundless, Śāriputra, so, too, are the four types of confidence of the Tathāgata boundless and unable to be comprehended by any sentient being. Śāriputra, if one could claim that there is a limit to space, then one could also claim to find a limit to the Tathāgata’s confidences. When the bodhisatva learns of this inconceivable confidence of the Tathāgata, he develops great faith, trust, and confidence, and he is without uncertainty and doubt. The Tathāgata brings him pleasure, joy, and satisfaction, and since these four types of confidence are as inconceivable as space, he considers them to be truly wondrous and extraordinary.”

source: ཆོས་ཀུན་མཉམ་པ་ཉིད་མཉམ་པར། །རང་བྱུང་བས་ནི་རྗེས་སུ་རྟོགས། །
en: “All dharmas are the same as sameness In his spontaneous realization.

source: དེ་ཕྱིར་ཡང་དག་མངོན་སངས་རྒྱས། །དེ་བཞིན་གཤེགས་པ་མཉམ་པ་གཟིགས། །
en: Thus, the fully realized Buddha, The Tathāgata, sees impartially.

source: སོ་སོའི་སྐྱེ་བོའི་ཆོས་གང་ཡིན། ། དེ་དག་སངས་རྒྱས་ཆོས་དང་མཉམ། ། སློབ་དང་མི་སློབ་ཆོས་རྣམས་དང་། །རང་རྒྱལ་གྱི་ནི་ཆོས་ཉིད་དང་།
en: “Whatever dharmas ordinary people have Are equally the dharmas of the Buddha And of those who need training and those who need no more And the true dharma of the pratyekajinas.

source: །གང་དག་འཇིག་རྟེན་ཆོས་རྣམས་དང་། །གང་དག་འཇིག་རྟེན་འདས་ཆོས་དང་། །དགེ་དང་མི་དགེ་མི་གཡོ་རྣམས། །མྱ་ངན་འདས་པའི་ལམ་དང་འདྲ། །
en: “The worldly dharmas, too, And the dharmas that transcend the world And the wholesome, unwholesome, and immovable Are like the path of nirvāṇa.

source: སྟོང་པ་ཉིད་དང་མཚན་མ་མེད། །
en: “Emptiness, freedom from attributes,

source: སྨོན་ལམ་དག་ནི་རྣམ་པར་སྤངས། །
en: Leaving wishes behind,

source: མ་སྐྱེས་མངོན་པར་འདུ་མི་བྱེད། །
en: Unborn, unconditioned,

source: འདི་ནི་མཉམ་པ་ཉིད་དུ་བརྟེན། །
en: This is the basis for this sameness.

source: འདི་དག་མཉམ་པ་ཉིད་རྟོགས་ནས། །
en: “Realizing the sameness of these,

source: ཐུབ་པ་ཆེན་པོ་མི་འཇིགས་པ། །གང་གིས་སེམས་ཅན་འགྲོལ་འགྱུར་བ། །དེ་བཞིན་དུ་ཡང་རབ་ཏུ་སྟོན། །
en: He gives instructions accordingly. The great sage is confident That sentient beings are liberated through this.

source: འཇིག་རྟེན་གསུམ་ལས་རྣམ་པར་གྲོལ། ། རྣམ་པར་ཐར་པ་རབ་ཏུ་སྟོན། །
en: “He gives instruction in liberation While liberated in the three worlds.

source: མི་དབང་གི་ནི་མི་འཇིགས་པ། །གཉིས་པ་ཡང་དག་རབ་ཏུ་བསྟན། །
en: This is proclaimed As the second confidence of the lord of men.

source: རྒྱལ་བས་གང་ཆོས་རྗེས་སུ་སངས་རྒྱས་པ། །མ་བསྟེན་པར་ནི་རྣམ་པར་གྲོལ་མི་འཐོབ། །
en: “There will be no attainment of liberation If one does not rely on the Dharma realized by the Victorious One.

source: བག་མེད་པ་དང་ཁྲེལ་བ་མེད་གྱུར་དང་། །གང་ལ་ངོ་ཚ་ཅི་ཡང་མེད་པ་དང་། །ལུས་དང་ངག་རྣམས་དང་ནི་ཡིད་ཀྱིས་སུ། །གང་དག་སྡོམ་པ་ནམ་ཡང་ཡོད་མིན་དང་། །འདུན་དང་ཞེ་སྡང་གཏི་མུག་འཇིགས་པ་དང་། །སྲོག་གཅོད་པ་དང་གཞན་ལ་འཚེ་བ་དང་། །གཞན་གྱི་ཆུང་མ་དེ་བཞིན་བརྫུན་དང་ཆང་། །ང་རྒྱལ་མི་གུས་དེ་ནི་བདུན་པའོ། །
en: Heedlessness; having no conscience; Lacking any kind of moral sensitivity; “Never keeping any sort of discipline Of body, speech, or mind; With fear, anger, or confusion, Killing, causing loss for others, “Adultery, lies, and liquor; Pride, lack of respect, which are the seven, Those that I tell you are wrong;

source: གང་དག་ལོག་པར་སྨྲ་བ་བརྒྱད་པ་སྟེ། ། ཐམས་ཅད་རྣམ་པར་གྲོལ་བའི་ལམ་རྒྱུན་གཅོད། །གང་དག་མནར་སེམས་དགུ་དང་ཉེས་མང་དང་། །མི་དགེ་བཅུ་ཡི་ལས་ཀྱི་ལམ་རྣམས་དང་། །གང་དག་ཚུལ་མིན་ཞི་བ་མི་ཤེས་པ། །དེ་དག་ལ་ནི་ནམ་ཡང་ཐར་པ་མེད། །
en: The eight that disrupt any path of liberation; “The nine malicious intentions with which evil thrives; And the ten unwholesome forms of conduct— With these one will not know how to get rid of superficial understanding, And one will never know liberation.

source: ཕྱིན་ཅི་ལོག་ལ་ཞུགས་པར་རིག་གྱུར་ནས། །
en: “Seeing how they are engaged in perversity,

source: བག་མེད་ཡང་དག་མ་ཡིན་སྨྲ་ལ་ཆགས། །
en: He speaks about the error of heedlessness.

source: རྒྱལ་བ་རྣམས་ཀྱི་མི་འཇིགས་གསུམ་པ་སྟེ། ། ཆོས་ཉིད་འདི་དག་ལ་ནི་བསྙེན་པར་བྱ། །
en: That one should base oneself on the way things are Is the Victorious One’s third confidence.

source: གང་དག་རྣམ་སྦྱོང་སྒོ་ནི་ཚད་མེད་ལ། །མི་གང་སྟོན་པ་བྱང་ཆུབ་རེག་པར་འགྱུར། །
en: “The doors one can enter to be purified are innumerable, And people who rely on them encounter awakening.

source: རྒྱལ་བ་ཉིད་ཀྱིས་མ་ཐོས་ཐམས་ཅད་རིག །
en: The Victorious One knows everything without learning it,

source: ཤེས་ནས་མི་འཆིར་འགྲོ་བའི་ཆོས་འཆད་དོ། །
en: And with this knowledge he speaks the Dharma of immortality.

source: ཇི་ཙམ་དགེ་བའི་ཆོས་ནི་མང་ཡོད་པ། །བྱང་ཆུབ་ཕྱོགས་དགེ་རྒྱལ་བས་བསྔགས་པ་ལ། །སྟེན་པ་རྣམ་པར་ཐར་པ་མི་འཐོབ་པ། །གནས་མེད་པར་ནི་སྟོབས་བཅུ་རྣམས་ཀྱིས་བཤད། །
en: “There are many dharmas that are wholesome, Virtues conducive to awakening, that the Victorious One praises. He does not depend on them to reach liberation. The one with ten powers says that there is no foundation.

source: ཚུལ་བཞིན་གྱིས་ནི་ཉོན་མོངས་མང་པོ་ཞི། །
en: “It is profound understanding that pacifies the abundant defilements;

source: ཡང་དག་ཆོས་དགེ་མཉམ་པ་མེད་ལྡན་ཞིང་། །ཆོས་དང་ཆོས་མ་ཡིན་ལ་དེ་མི་ཆགས། །
en: The true wholesome dharmas are beyond equal. Based on neither dharmas nor non-dharmas,

source: ཞི་བ་མྱ་ངན་མེད་པ་རྣམ་གྲོལ་རེག །
en: One meets liberation, peace, the painless state.

source: གསོག་གསོ་བ་ནམ་མཁའ་འདྲ་ཞིང་ཡ་མ་བརླ། །སྒྱུ་མའི་གཟུགས་འདྲ་ནམ་མཁའ་ལྟ་བུ་དང་། །དགེ་ཆོས་རྣམ་པ་གང་གིས་རབ་ཤེས་པ། །དེ་ནི་སྲིད་པའི་མཚོ་ལས་ཐར་པར་འགྱུར། །
en: “One who knows that the various wholesome dharmas Are hollow, void, and empty—like space, Like illusory shapes, like space— Is released from the ocean of existence.

source: ཐུབ་པ་སྟོབས་བཅུ་རྣམས་ཀྱི་ཆོས་འདི་ནི། །འགྲོ་བ་གང་མོས་སྲིད་པར་འགྲོ་བ་ལ། །སྙིང་རྗེ་སྙིང་བརྩེ་བྱས་ནས་ཐར་བྱེད་དེ། །
en: “This Dharma of the sages with ten powers Liberates heedless travelers journeying through existence, And it does so through compassion and love.

source: མི་འཇིགས་བཞི་པ་ནམ་མཁའ་འདྲ་བའོ། །
en: This is the fourth space-like confidence.

source: དེ་ལྟར་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་མངོན་པར་དད། ། ཡིད་ཆེས། རབ་ཏུ་རྟོག ། སོམ་ཉི་མེད། ཐེ་ཚོམ་མི་ཟ་བ་ནས། ནམ་མཁའ་ལྟ་བུར་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར། ངོ་མཚར་དང་། རྨད་ཀྱི་བར་དུ་འདུ་ཤེས་སྐྱེད་དོ། །
en: “These, Śāriputra, are the inconceivable confidences of the Tathāgata, in which the bodhisatva has great faith, trust, and confidence and about which he is without uncertainty and doubt. The Tathāgata brings him pleasure, joy, and satisfaction, and as these confidences are as inconceivable as space, he considers them to be truly wondrous and extraordinary.

source: ཤཱ་རིའི་བུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་མངོན་པར་དད། ཡིད་ཆེས། རབ་ཏུ་རྟོག ། སོམ་ཉི་མེད། ཐེ་ཚོམ་མི་ཟ་བ་ནས། ངོ་མཚར་དང་། རྨད་ཀྱི་བར་དུ་འདུ་ཤེས་སྐྱེད་ཅེ་ན། འདི་ལ་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྙིང་རྗེ་ཆེན་པོ་ནི་སེམས་ཅན་ཐམས་ཅད་རྗེས་སུ་མི་གཏོང་ཞིང་རྟག་ཏུ་འཇུག་པ། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་འགྱུར་བ་སྟེ། མི་ལྡོག་པར་རིག་པར་བྱའོ། ། དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་དེ་ཡང་ཇི་ལྟར་ངག་གི་ལས་ཀྱིས་ཀྱང་ཁོང་དུ་ཆུད་པར་བྱ་བ་སླ་བ་མ་ཡིན་པ་དེ་ལྟར་ཚད་མེད། དེ་ལྟར་བསམ་གྱིས་མི་ཁྱབ། དེ་ལྟར་མཚུངས་པ་མེད། དེ་ལྟར་དཔག་ཏུ་མེད། དེ་ལྟར་བརྗོད་དུ་མེད། དེ་ལྟར་མི་ཟད་ཅིང་ཁོང་དུ་ཆུད་པར་དཀའོ། །
en: “Śāriputra, what is it about the inconceivable great tathāgata-compassion of the Tathāgata that leads the bodhisatva to have faith, trust, and confidence, and so forth and to consider it to be truly wondrous and extraordinary? Śāriputra, it should be understood that because of this great compassion, the tathāgatas never abandon sentient beings but constantly engage with them all. They work to bring sentient beings to maturity, and they never give up. This great tathāgata compassion is so immeasurable, so inconceivable, so incomparable, so boundless, so inexpressible, and so strong that it cannot easily be put into words.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཇི་ལྟར་དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་ཐོབ་པ་དེ་ལྟར་སེམས་ཅན་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་འཇུག་སྟེ། བྱང་ཆུབ་ཅི་འདྲ་བ་སྙིང་རྗེ་ཆེན་པོ་ཡང་དེ་འདྲའོ། ། དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་ཇི་ལྟར་ཐོབ་ཅེ་ན། དེ་བཞིན་གཤེགས་པས་རྩ་བ་མེད་པ། གནས་མེད་པའི་བྱང་ཆུབ་ཐོབ་བོ། །དེ་ལ་རྩ་བ་གང་། གནས་གང་ཞེ་ན། འཇིག་ཚོགས་ནི་རྩ་བའོ། ། ཡང་དག་པ་མ་ཡིན་པ་ཀུན་རྟོག་པ་ནི་གནས་སོ། ། དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་མཉམ་པ་ཉིད་ཀྱི་ཕྱིར་དེ་དག་མཉམ་པར་མཁྱེན་ཏེ། དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་རྩ་བ་མེད་པ། གནས་མེད་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཤེས་བྱ་སྟེ། སེམས་ཅན་འདི་དག་ནི་རྩ་བ་མེད་པ་གནས་མེད་པར་མི་ཤེས་པས་དེ་དག་ཤེས་པར་བྱའོ་ཞེས་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་འཇུག་གོ །
en: “How so? Because the Tathāgata has attained awakening, he has great compassion for sentient beings. He is just as compassionate as he is awakened. What is the Tathāgata’s attainment of awakening like? The Tathāgata’s attainment of awakening is rootless and without foundation. What is the root and the foundation in this context? The root is separate existence, and the foundation is false mental constructs. The Tathāgata understands these completely because of his awakening, which is the same as sameness, and it is therefore said that the Tathāgata has fully realized the awakening that is rootless and without foundation. With great compassion for sentient beings, the Tathāgata sees that sentient beings do not understand rootlessness and lack of foundation, and so he pledges to help them understand.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་བྱང་ཆུབ་ནི་ཞི་བ་དང་། ཉེ་བར་ཞི་བའོ། ། དེ་ཇི་ལྟར་ཞི། ཇི་ལྟར་ཉེ་བར་ཞི་ཞེ་ན། ནང་ཞི་བའོ། ། ཕྱི་རོལ་ཉེ་བར་ཞི་བའོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། མིག་ནི་བདག་དང་བདག་གིས་སྟོང་སྟེ། དེའི་རང་བཞིན་ནི་འདི་ཡིན་པས་ན་དེའི་ཕྱིར་ཞི་བ་ཞེས་བྱའོ། ། དེ་བཞིན་དུ་རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ནི་བདག་དང་བདག་གིས་སྟོང་སྟེ། དེའི་རང་བཞིན་འདི་ཡིན་པས་ན། དེའི་ཕྱིར་ཞི་བ་ཞེས་བྱའོ། ། དེའི་མིག་སྟོང་པར་ཡོངས་སུ་ཤེས་ནས། གཟུགས་ལ་མི་རྒྱུག་སྟེ། དེའི་ཕྱིར་ཉེ་བར་ཞི་བ་ཞེས་བྱའོ། ། ཡིད་ཀྱི་བར་དུ་ཡང་སྟོང་པར་ཡོངས་སུ་ཤེས་ནས་ཆོས་ལ་མི་རྒྱུག་སྟེ། དེའི་ཕྱིར་ཉེ་བར་ཞི་བ་ཞེས་བྱ་ན། སེམས་ཅན་འདི་དག་ནི་ཞི་བ་དང་ཉེ་བར་ཞི་བ་འདི་མི་ཤེས་ཏེ། དེ་དག་ཤེས་པར་བྱའོ། ། ཞེས་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་འཇུག་གོ །
en: “Moreover, Śāriputra, awakening is tranquility and peace. What are tranquility and peace in this context? Tranquility relates to the internal, and peace relates to the external. How so? The eye is empty of self and owner, and as this is its nature, it is said to be tranquil. Likewise, the ear, the nose, the tongue, the body, and the mind are empty of self and owner, and as this is their nature, they are said to be tranquil. When it is understood that the eye is empty, there is no attraction to form, and this is why it is called peace. When it is understood that the rest, up to and including mind, are empty, there is no attraction to mental phenomena and so forth, and this is why it is called peace. With great compassion for sentient beings, the Tathāgata sees that they do not recognize tranquility and peace, and so he pledges to help them understand.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་ངས་ནི་རང་བཞིན་གྱིས་འོད་གསལ་བར་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། ། ཇི་ལྟར་འོད་གསལ་ཞེ་ན། རང་བཞིན་གང་ཡིན་པ་དེ་ནི་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་སྟེ། ནམ་མཁའ་ལྟ་བུའོ། ། ནམ་མཁའི་རང་བཞིན་ནོ། ། ནམ་མཁའི་རྗེས་སུ་འབྲང་བའོ། ། ནམ་མཁའ་དང་མཉམ་པ་ཉིད་ཀྱིས་མཉམ་པ་སྟེ། དེ་ནི་རང་བཞིན་གྱིས་ཤིན་ཏུ་འོད་གསལ་བ་ན་རང་བཞིན་གྱིས་འོད་གསལ་བ་འདི་ཁོང་དུ་མ་ཆུད་པས་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་བློ་བུར་གྱི་ཉོན་མོངས་པས་ཀུན་ནས་ཉོན་མོངས་ཏེ། སེམས་ཅན་རྣམས་རང་བཞིན་གྱིས་འོད་གསལ་བ་འདི་མི་ཤེས་པས་དེ་དག་རང་བཞིན་གྱིས་འོད་གསལ་བ་ཁོང་དུ་ཆུད་པར་བྱའོ་ཞེས་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་འཇུག་གོ།
en: “Moreover, Śāriputra, the awakening fully attained by me is naturally radiant. In what way is it radiant? As it is natural, it is not defiled. It is like space. It has the nature of space. It merges with space. It is the same as the sameness of space. Radiance means being completely natural, but as ordinary beings do not appreciate this natural quality of radiance, they are afflicted by adventitious defilements. With great compassion for sentient beings, the Tathāgata sees that they do not recognize this natural radiance, and so he pledges to help them awaken to it.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་ངས་ནི་བླང་བ་མེད་པ་དང་། དོར་བ་མེད་པར་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། ། དེ་ལ་བླང་བ་མེད་པ་གང་དོར་བ་མེད་པ་གང་ཞེ་ན། བླང་བ་མེད་པ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་མི་འཛིན་པའོ། ། དོར་བ་མེད་པ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་རབ་ཏུ་འཛིན་པ་མེད་པའོ། ། དེ་ལ་དེ་བཞིན་གཤེགས་པས་བླང་བ་མེད་པ་དང་། དོར་བ་མེད་པའི་ངོ་བོ་ཉིད་མཉམ་པ་ཉིད་དུ་གཟིགས་ཏེ། ཇི་ལྟར་དེ་བཞིན་གཤེགས་པས་ཚུ་རོལ་མེད་པ་དང་། ཕ་རོལ་མེད་པར་གཟིགས་པ་དེ་ལྟར་ཆོས་ཐམས་ཅད་ཚུ་རོལ་དང་། ཕ་རོལ་དང་བྲལ་བར་དེ་བཞིན་གཤེགས་པས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ་དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱའོ། ། བླང་བ་མེད་པ་དང་། དོར་བ་མེད་པ་འདི་སེམས་ཅན་རྣམས་ཀྱིས་ཁོང་དུ་མ་ཆུད་པས་དེ་ཁོང་དུ་ཆུད་པར་བྱའོ་ཞེས་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་འཇུག་གོ །
en: “Moreover, Śāriputra, the awakening fully attained by me is free of exertion and abandonment. In what way is it free of exertion, and in what way is it free of abandonment? It is said to be free of exertion because one does not hold on to phenomena. It is said to be free of abandonment because there is no apprehension of phenomena. In this regard, the Tathāgata has arrived at the confluence of the rivers of exertion and abandonment, where there is no exertion and no abandonment. The Tathāgata does not see in terms of this or that, and therefore the Tathāgata has completely realized all phenomena beyond conflicting views. This is why he is referred to as the one who understands things just as they are, a tathāgata. With great compassion for sentient beings, the Tathāgata sees that they do not recognize this freedom from exertion and from abandonment, and so he pledges to help them see it.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་ངས་མཚན་མ་མེད་པ་དང་། དམིགས་པ་མེད་པར་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། ། དེ་ལ་མཚན་མ་མེད་པ་གང་། དམིགས་པ་མེད་པ་གང་ཞེ་ན། མིག་གི་རྣམ་པར་ཤེས་པ་མི་དམིགས་པ་ནི་མཚན་མ་མེད་པའོ། ། གཟུགས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་ནི་དམིགས་པ་མེད་པའོ། ། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་བར་དུ་མི་དམིགས་པ་ནི་མཚན་མ་མེད་པའོ། ། ཆོས་ཡང་དག་ར་རྗེས་སུ་མི་མཐོང་བ་ནི་དམིགས་པ་མེད་པའོ། ། དེ་ལྟར་ཤཱ་རིའི་བུ་མཚན་མ་མེད་པ་དང་། དམིགས་པ་མེད་པ་ནི་འཕགས་པ་རྣམས་ཀྱི་སྤྱོད་ཡུལ་ལོ། ། འཕགས་པ་རྣམས་ཀྱི་སྤྱོད་ཡུལ་གང་ཞེ་ན། ཁམས་གསུམ་པ་ནི་འཕགས་པ་རྣམས་ཀྱི་སྤྱོད་ཡུལ་ཏེ། གང་འཕགས་པ་རྣམས་ཀྱི་སྤྱོད་ཡུལ་དེ་ནི་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་ཐམས་ཅད་ཀྱི་སྤྱོད་ཡུལ་མ་ཡིན་པས་དེ་ཁོང་དུ་ཆུད་པར་བྱའོ་ཞེས་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་འཇུག་གོ །
en: “Moreover, Śāriputra, the awakening fully attained by me has no attributes, and it is not an object. In what way is it without attributes, and in what way is it not an object? As it is not an object of eye consciousness, it does not have attributes. As it is not a form that can be observed, it is not an object. Neither is it an object of the others, up to and including mind consciousness, and so it does not have attributes. As it is not a mental phenomenon that can be observed, it is not an object. Therefore, Śāriputra, as it does not have attributes and is not an object, it is the domain of the noble ones. What is the domain of the noble ones? The three realms are the domain of the noble ones. With great compassion for sentient beings, the Tathāgata sees that the domain of the noble ones is not the domain of all ordinary, immature beings, and so he pledges to help them realize it.
